#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.logs.aws_cloudwatch_log_group.minimal_lambda_function: Refreshing state... [id=/aws/lambda/demo/minimal_lambda_function]
module.network.aws_api_gateway_method.method: Refreshing state... [id=agm-kb7gblbu69-9mwrfv-GET]
module.functions.aws_lambda_function.minimal_lambda_function: Refreshing state... [id=demo_minimal_lambda_function]
module.buckets.aws_s3_bucket_object.minimal_function_object: Refreshing state... [id=lambdas/demo/helloWorldHandler.zip]
module.network.aws_api_gateway_integration.integration: Refreshing state... [id=agi-kb7gblbu69-9mwrfv-GET]
module.policy.aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.codebuild.aws_codebuild_source_credential.git_credential: Refreshing state... [id=arn:aws:codebuild:us-west-2:435552912911:token/github]
module.sql.aws_db_subnet_group.kpinetwork: Refreshing state... [id=demokpinetwork]
module.buckets.aws_s3_bucket_object.get_company_function_object: Refreshing state... [id=lambdas/demo/getCompanyHandler.zip]
module.network.aws_api_gateway_rest_api.api: Refreshing state... [id=kb7gblbu69]
module.buckets.aws_s3_bucket_object.get_all_companies_function_object: Refreshing state... [id=lambdas/demo/getAllCompaniesHandler.zip]
module.logs.aws_cloudwatch_log_group.codebuild_rds_migrations: Refreshing state... [id=/aws/codebuild/demo/rds_migrations]
aws_route53_zone.kpinetwork: Refreshing state... [id=Z02521762FZPW0IDM8JJO]
module.sql.aws_db_instance.kpinetwork_db: Refreshing state... [id=demokpinetworkdb]
module.cert.aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:435552912911:certificate/2e6953ea-c466-4ff3-baa9-7e8c3440affa]
module.network.aws_api_gateway_resource.companies: Refreshing state... [id=bnvar7]
module.network.aws_api_gateway_resource.resource: Refreshing state... [id=9mwrfv]
module.network.aws_api_gateway_resource.company: Refreshing state... [id=sjvaet]
module.network.aws_api_gateway_method.get_all_companies_method: Refreshing state... [id=agm-kb7gblbu69-bnvar7-GET]
module.functions.aws_lambda_function.get_all_companies_lambda_function: Refreshing state... [id=demo_get_all_companies_lambda_function]
module.functions.aws_lambda_function.get_company_lambda_function: Refreshing state... [id=demo_get_company_lambda_function]
module.codebuild.aws_codebuild_project.rds_migrations: Refreshing state... [id=arn:aws:codebuild:us-west-2:435552912911:project/demo_rds_migrations]
module.network.aws_api_gateway_method.get_company_method: Refreshing state... [id=agm-kb7gblbu69-sjvaet-GET]
module.policy.aws_lambda_permission.apigw_get_all_companies_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_get_company_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayCompanyId]
module.network.aws_api_gateway_integration.companies_integration: Refreshing state... [id=agi-kb7gblbu69-bnvar7-GET]
module.network.aws_api_gateway_integration.company_integration: Refreshing state... [id=agi-kb7gblbu69-sjvaet-GET]
module.network.aws_api_gateway_deployment.gateway_deployment: Refreshing state... [id=xrqyig]
module.dns.aws_route53_record.cert_validations[0]: Refreshing state... [id=Z02521762FZPW0IDM8JJO__24e3048f36be454712f534258ba1d3c2.api.demo.kpinetwork.com._CNAME]
module.dns.aws_route53_record.cert_validations[1]: Refreshing state... [id=Z02521762FZPW0IDM8JJO__24e3048f36be454712f534258ba1d3c2.api.demo.kpinetwork.com._CNAME]
module.cert.aws_acm_certificate_validation.cert: Refreshing state... [id=2021-10-15 14:52:46 +0000 UTC]
module.network.aws_api_gateway_domain_name.domain: Refreshing state... [id=api.demo.kpinetwork.com]
module.network.aws_api_gateway_base_path_mapping.domain_mapping: Refreshing state... [id=api.demo.kpinetwork.com/]
module.dns.aws_route53_record.kpinetwork_domain: Refreshing state... [id=Z02521762FZPW0IDM8JJO_api.demo.kpinetwork.com_A]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.network.aws_api_gateway_method.get_all_companies_method has been changed
  ~ resource "aws_api_gateway_method" "get_all_companies_method" {
        id                   = "agm-kb7gblbu69-bnvar7-GET"
      ~ request_parameters   = {
          ~ "method.request.querystring.limit"  = true -> false
          ~ "method.request.querystring.offset" = true -> false
        }
        # (7 unchanged attributes hidden)
    }
  # module.policy.aws_lambda_permission.apigw_lambda has been deleted
  - resource "aws_lambda_permission" "apigw_lambda" {
      - action        = "lambda:InvokeFunction" -> null
      - function_name = "demo_minimal_lambda_function" -> null
      - id            = "AllowExecutionFromAPIGateway" -> null
      - principal     = "apigateway.amazonaws.com" -> null
      - qualifier     = "" -> null
      - source_arn    = (sensitive) -> null
      - statement_id  = "AllowExecutionFromAPIGateway" -> null
    }
  # module.logs.aws_cloudwatch_log_group.minimal_lambda_function has been deleted
  - resource "aws_cloudwatch_log_group" "minimal_lambda_function" {
      - arn               = "arn:aws:logs:us-west-2:435552912911:log-group:/aws/lambda/demo/minimal_lambda_function" -> null
      - id                = "/aws/lambda/demo/minimal_lambda_function" -> null
      - name              = "/aws/lambda/demo/minimal_lambda_function" -> null
      - retention_in_days = 14 -> null
      - tags              = {} -> null
      - tags_all          = {} -> null
    }
  # module.functions.aws_lambda_function.minimal_lambda_function has been changed
  ~ resource "aws_lambda_function" "minimal_lambda_function" {
        id                             = "demo_minimal_lambda_function"
      ~ last_modified                  = "2021-10-29T20:21:43.750+0000" -> "2021-11-03T21:39:51.919+0000"
        tags                           = {}
        # (19 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.functions.aws_lambda_function.get_all_companies_lambda_function has been changed
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2021-10-29T20:21:44.097+0000" -> "2021-11-03T21:40:01.228+0000"
      ~ layers                         = [
          + "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:3",
        ]
      ~ role                           = "arn:aws:iam::435552912911:role/lambda_exec" -> "arn:aws:iam::435552912911:role/companies_lambda_exec"
        tags                           = {}
        # (23 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }
  # module.functions.aws_lambda_function.get_company_lambda_function has been changed
  ~ resource "aws_lambda_function" "get_company_lambda_function" {
        id                             = "demo_get_company_lambda_function"
      ~ last_modified                  = "2021-10-29T20:21:44.020+0000" -> "2021-11-03T21:40:03.740+0000"
      ~ layers                         = [
          + "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:3",
        ]
      ~ role                           = "arn:aws:iam::435552912911:role/lambda_exec" -> "arn:aws:iam::435552912911:role/company_lambda_exec"
        tags                           = {}
        # (23 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object must be replaced
+/- resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "8629fdb25897db86a92b6cca12884d0d" -> "eadbd70f4d572e5f558e57ce1f111026"
      ~ id                     = "lambdas/demo/getAllCompaniesHandler.zip" -> (known after apply)
      ~ key                    = "lambdas/demo/getAllCompaniesHandler.zip" -> "lambdas/demo/get_all_companies_handler.zip" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      + server_side_encryption = (known after apply)
      ~ source                 = "buckets/../../dist/getAllCompaniesHandler.zip" -> "buckets/../../dist/get_all_companies_handler.zip"
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_function_object must be replaced
+/- resource "aws_s3_bucket_object" "get_company_function_object" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "a4cd1d4f6dfcb027f4db007e0ec7f44a" -> "9cb581a696cde526bd833d61da139ad6"
      ~ id                     = "lambdas/demo/getCompanyHandler.zip" -> (known after apply)
      ~ key                    = "lambdas/demo/getCompanyHandler.zip" -> "lambdas/demo/get_company_handler.zip" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      + server_side_encryption = (known after apply)
      ~ source                 = "buckets/../../dist/getCompanyHandler.zip" -> "buckets/../../dist/get_company_handler.zip"
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be created
  + resource "aws_s3_bucket_object" "layer_libraries_object" {
      + acl                    = "private"
      + bucket                 = "kpinetwork-backend"
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "13bde4028bc82c3f3a8abfdc0cb62b56"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "layer/demo/layer_libraries.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "buckets/../../dist/layer_libraries.zip"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.buckets.aws_s3_bucket_object.minimal_function_object will be destroyed
  - resource "aws_s3_bucket_object" "minimal_function_object" {
      - acl                = "private" -> null
      - bucket             = "kpinetwork-backend" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "binary/octet-stream" -> null
      - etag               = "0bd9fcc53ce5587c3bbde7e7da644f05" -> null
      - force_destroy      = false -> null
      - id                 = "lambdas/demo/helloWorldHandler.zip" -> null
      - key                = "lambdas/demo/helloWorldHandler.zip" -> null
      - metadata           = {} -> null
      - source             = "buckets/../../dist/helloWorldHandler.zip" -> null
      - storage_class      = "STANDARD" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2021-11-03T21:40:01.228+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:3",
        ] -> (known after apply)
      ~ role                           = "arn:aws:iam::435552912911:role/companies_lambda_exec" -> (known after apply)
      ~ s3_key                         = "lambdas/demo/getAllCompaniesHandler.zip" -> "lambdas/demo/get_all_companies_handler.zip"
      ~ source_code_hash               = "r79poNXzM/x212ZkAGhUVFVfdtbR7UbD9Tl7+PQL2Zc=" -> "Ig4QIQg64ElPG6xHrVBmzCljgHRh8yMBDfNunDv34Wk="
        tags                           = {}
        # (21 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_lambda_function" {
        id                             = "demo_get_company_lambda_function"
      ~ last_modified                  = "2021-11-03T21:40:03.740+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:3",
        ] -> (known after apply)
      ~ role                           = "arn:aws:iam::435552912911:role/company_lambda_exec" -> (known after apply)
      ~ s3_key                         = "lambdas/demo/getCompanyHandler.zip" -> "lambdas/demo/get_company_handler.zip"
      ~ source_code_hash               = "F5HJBY9+L4VBXy106RROm9+kX23fy1zkq1r0KzGmpVM=" -> "dr3UCVh0TqJ+7Vmy0FQVTpY3VHkDUCbs8s8BP9MlZqE="
        tags                           = {}
        # (21 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.minimal_lambda_function will be destroyed
  - resource "aws_lambda_function" "minimal_lambda_function" {
      - arn                            = "arn:aws:lambda:us-west-2:435552912911:function:demo_minimal_lambda_function" -> null
      - function_name                  = "demo_minimal_lambda_function" -> null
      - handler                        = "helloWorldHandler.handler" -> null
      - id                             = "demo_minimal_lambda_function" -> null
      - invoke_arn                     = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:435552912911:function:demo_minimal_lambda_function/invocations" -> null
      - last_modified                  = "2021-11-03T21:39:51.919+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:us-west-2:435552912911:function:demo_minimal_lambda_function:$LATEST" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::435552912911:role/lambda_exec" -> null
      - runtime                        = "python3.6" -> null
      - s3_bucket                      = "kpinetwork-backend" -> null
      - s3_key                         = "lambdas/demo/helloWorldHandler.zip" -> null
      - source_code_hash               = "g+DaLX/o5b/fRMDZmu+w65gomUB/ZO+oqxC72KuBF+I=" -> null
      - source_code_size               = 620 -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
      - timeout                        = 3 -> null
      - version                        = "$LATEST" -> null

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.functions.aws_lambda_layer_version.db_lambda_layer will be created
  + resource "aws_lambda_layer_version" "db_lambda_layer" {
      + arn                         = (known after apply)
      + compatible_runtimes         = [
          + "python3.6",
        ]
      + created_date                = (known after apply)
      + id                          = (known after apply)
      + layer_arn                   = (known after apply)
      + layer_name                  = "demo_db_lambda_layer"
      + s3_bucket                   = "kpinetwork-backend"
      + s3_key                      = "layer/demo/layer_libraries.zip"
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      + source_code_size            = (known after apply)
      + version                     = (known after apply)
    }

  # module.logs.aws_cloudwatch_log_group.get_all_companyies_lambda_function will be created
  + resource "aws_cloudwatch_log_group" "get_all_companyies_lambda_function" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/demo/get_all_companies_lambda_function"
      + retention_in_days = 14
      + tags_all          = (known after apply)
    }

  # module.logs.aws_cloudwatch_log_group.get_company_lambda_function will be created
  + resource "aws_cloudwatch_log_group" "get_company_lambda_function" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/demo/get_company_lambda_function"
      + retention_in_days = 14
      + tags_all          = (known after apply)
    }

  # module.network.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2021-10-29T20:21:43Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "xrqyig" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2021-10-29T20:21:42Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_api_gateway_integration.integration will be destroyed
  - resource "aws_api_gateway_integration" "integration" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "9mwrfv" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "GET" -> null
      - id                      = "agi-kb7gblbu69-9mwrfv-GET" -> null
      - integration_http_method = "POST" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      - resource_id             = "9mwrfv" -> null
      - rest_api_id             = "kb7gblbu69" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "AWS_PROXY" -> null
      - uri                     = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:435552912911:function:demo_minimal_lambda_function/invocations" -> null
    }

  # module.network.aws_api_gateway_method.method will be destroyed
  - resource "aws_api_gateway_method" "method" {
      - api_key_required     = false -> null
      - authorization        = "NONE" -> null
      - authorization_scopes = [] -> null
      - http_method          = "GET" -> null
      - id                   = "agm-kb7gblbu69-9mwrfv-GET" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "9mwrfv" -> null
      - rest_api_id          = "kb7gblbu69" -> null
    }

  # module.policy.aws_iam_role.companies_lambda_exec_role will be created
  + resource "aws_iam_role" "companies_lambda_exec_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Allows Lambda Function to call AWS services on your behalf."
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "companies_lambda_exec"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.policy.aws_iam_role.company_lambda_exec_role will be created
  + resource "aws_iam_role" "company_lambda_exec_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Allows Lambda Function to call AWS services on your behalf."
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "company_lambda_exec"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.policy.aws_iam_role_policy_attachment.companies_lambda_logs will be created
  + resource "aws_iam_role_policy_attachment" "companies_lambda_logs" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::435552912911:policy/iam_policy_lambda_logging_function"
      + role       = "companies_lambda_exec"
    }

  # module.policy.aws_iam_role_policy_attachment.companies_lambda_vpc will be created
  + resource "aws_iam_role_policy_attachment" "companies_lambda_vpc" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::435552912911:policy/iam_policy_lambda_network_function"
      + role       = "companies_lambda_exec"
    }

  # module.policy.aws_iam_role_policy_attachment.company_lambda_logs will be created
  + resource "aws_iam_role_policy_attachment" "company_lambda_logs" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::435552912911:policy/iam_policy_lambda_logging_function"
      + role       = "company_lambda_exec"
    }

  # module.policy.aws_iam_role_policy_attachment.company_lambda_vpc will be created
  + resource "aws_iam_role_policy_attachment" "company_lambda_vpc" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::435552912911:policy/iam_policy_lambda_network_function"
      + role       = "company_lambda_exec"
    }

Plan: 13 to add, 2 to change, 7 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @kellycastrof, Action: `pull_request`*